[
  {
    "id": "sd-1",
    "options": [
      "The ability of the system to run as fast as possible",
      "The capability to handle a growing amount of work by adding resources to the system",
      "The ability to securely protect the system against attacks",
      "The ability to automatically fix bugs"
    ],
    "explanation": "Scalability is the property of a system to handle a growing amount of work by adding resources (hardware, servers) without negatively impacting performance.",
    "questionText": "In system design, what does 'Scalability' refer to?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-2",
    "options": [
      "Scale Up adds new servers, Scale Out upgrades the current server",
      "Scale Up upgrades the current server (CPU/RAM), Scale Out adds more servers",
      "Scale Up is cheaper than Scale Out",
      "Scale Out is only used for databases"
    ],
    "explanation": "Vertical Scaling (Up) means upgrading the power (CPU, RAM) of a single machine. Horizontal Scaling (Out) means adding more machines into your pool of resources to distribute the load.",
    "questionText": "What is the main difference between Vertical Scaling (Scale Up) and Horizontal Scaling (Scale Out)?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-3",
    "options": [
      "Storing user data",
      "Distributing incoming network traffic across multiple servers to prevent overloading any single server",
      "Encrypting transmitted data",
      "Increasing database query speed"
    ],
    "explanation": "A Load Balancer sits between the client and the server farm, distributing incoming requests across servers based on algorithms (Round Robin, Least Connections, etc.) to optimize resource use and maximize throughput.",
    "questionText": "What is the main function of a Load Balancer?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-4",
    "options": [
      "1",
      "2",
      "3",
      "4"
    ],
    "explanation": "The CAP Theorem states that a distributed data store can only simultaneously provide two out of the three guarantees: Consistency, Availability, and Partition Tolerance.",
    "questionText": "According to the CAP Theorem, how many properties can a distributed system guarantee simultaneously?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-5",
    "options": [
      "Backing up the database to multiple locations",
      "Dividing a large database into smaller, faster, more easily managed parts (shards) stored across different servers",
      "Encrypting data in the database",
      "Creating indexes for the database"
    ],
    "explanation": "Sharding is a type of database partitioning that separates very large databases into smaller, faster, more easily managed parts called data shards. It implies horizontal partitioning based on a specific key (e.g., User ID).",
    "questionText": "What is Database Sharding?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-6",
    "options": [
      "By increasing the hard drive write speed",
      "By reducing database load and storing frequently accessed data in fast memory (RAM)",
      "By securely encrypting data",
      "By automatically fixing code errors"
    ],
    "explanation": "Caching stores frequently accessed data in RAM (using tools like Redis or Memcached), allowing requests to be served extremely fast without needing to query the slower underlying Database.",
    "questionText": "How does Caching improve system performance?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-7",
    "options": [
      "Processing complex backend business logic",
      "Distributing static content (images, videos, css/js) to users from servers geographically closest to them",
      "Storing transactional databases",
      "Managing user authentication"
    ],
    "explanation": "A Content Delivery Network (CDN) is a geographically distributed group of servers that work together to provide fast delivery of static Internet content (HTML pages, javascript files, stylesheets, images, and videos), significantly reducing latency.",
    "questionText": "What is a CDN (Content Delivery Network) most useful for?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-8",
    "options": [
      "A single software bug",
      "A part of a system that, if it fails, will stop the entire system from working",
      "A hacker attacking the system",
      "A backup server"
    ],
    "explanation": "A Single Point of Failure (SPOF) is a critical flaw in system design. The goal of High Availability architecture is to eliminate SPOFs by introducing redundancy.",
    "questionText": "What is a Single Point of Failure (SPOF)?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-9",
    "options": [
      "The number of requests the system can process per second (Throughput)",
      "The time it takes for a data packet to travel from a source to a destination (and back)",
      "Hard drive capacity",
      "Network bandwidth"
    ],
    "explanation": "Latency is the delay before a transfer of data begins following an instruction. It is primarily measured in milliseconds (ms). Low latency is the primary goal of real-time systems.",
    "questionText": "What does the term 'Latency' measure?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-10",
    "options": [
      "Microservices use a smaller database",
      "A Monolith is built as one single unified unit, while Microservices break the system down into a collection of smaller, independent services",
      "Microservices run slower",
      "Monoliths are only used for start-ups"
    ],
    "explanation": "Microservices architecturally separate an application into loosely coupled, small services that can be developed, deployed, and scaled independently. A Monolith couples all components into one massive codebase and deployable unit.",
    "questionText": "How does Microservices Architecture differ from Monolithic Architecture?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-11",
    "options": [
      "Atomicity, Consistency, Isolation, Durability",
      "Availability, Consistency, Isolation, Durability",
      "Atomicity, Cache, Isolation, Database",
      "Access, Control, Interface, Data"
    ],
    "explanation": "ACID refers to the set of 4 key properties that guarantee database transactions are processed reliably: Atomicity, Consistency, Isolation, and Durability.",
    "questionText": "What does ACID stand for in Database Transactions?",
    "correctAnswerIndex": 0,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-12",
    "options": [
      "Limiting the server's internet bandwidth",
      "Controlling the amount of incoming requests from a single client within a specific timeframe to protect the system (prevent DDoS/Spam)",
      "Restricting the number of employees who can access the system",
      "Increasing processing speed"
    ],
    "explanation": "Rate Limiting helps prevent abuse and protects server resources from being overwhelmed by a sudden spike in traffic, a brute-force attack, or a DDoS attack.",
    "questionText": "What is Rate Limiting utilized for?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-13",
    "options": [
      "A Denial of Service (DoS) attack",
      "Injecting malicious SQL code into queries via user input to manipulate the database unauthorizedly",
      "Hijacking server administrative controls",
      "Eavesdropping on network traffic"
    ],
    "explanation": "SQL Injection exploits vulnerabilities where user inputs are not properly sanitized, allowing attackers to execute arbitrary SQL commands (like DROP TABLE, SELECT * users, or bypassing login).",
    "questionText": "What type of attack is SQL Injection?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-14",
    "options": [
      "HTTP/1.1",
      "FTP",
      "WebSocket",
      "SMTP"
    ],
    "explanation": "WebSocket provides full-duplex, continuous communication channels over a single TCP connection, making it ideal for push notifications, real-time chats, and live gaming updates.",
    "questionText": "Which protocol is commonly used for Real-time communication?",
    "correctAnswerIndex": 2,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-15",
    "options": [
      "Helping services communicate synchronously",
      "Facilitating asynchronous communication, decoupling services, and buffering sudden traffic spikes (load smoothing)",
      "Completely replacing databases",
      "Accelerating CPU clock speeds"
    ],
    "explanation": "Message Queues enable asynchronous processing, allowing services to remain decoupled. A producer can push a message to the queue without waiting for the consumer to process it immediately, increasing system resilience.",
    "questionText": "What primary problem does a Message Queue (e.g., RabbitMQ, Kafka) solve in Microservices?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-16",
    "options": [
      "Hashing user passwords securely",
      "Distributing data/keys across multiple nodes in a distributed system (like Distributed Cache/DB) to minimize data movement when a node is added or removed",
      "Compressing payload data",
      "Sorting arrays of data"
    ],
    "explanation": "Consistent Hashing ensures that when a server is added or removed from a cluster, only a small fraction of keys (k/n) need to be remapped, rather than remapping nearly all keys (as seen in standard modulo hashing).",
    "questionText": "In what scenario is Consistent Hashing normally implemented?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-17",
    "options": [
      "SQL is inherently faster than NoSQL",
      "SQL enforces rigid structured Schemas and strict ACID properties; NoSQL is flexible (Schema-less) and scales horizontally easily, often favoring BASE",
      "NoSQL does not support storing textual data",
      "SQL databases exclusively operate on Windows OS"
    ],
    "explanation": "SQL databases (MySQL, Postgres) use tightly structured tables and relations. NoSQL databases (MongoDB, Cassandra) are extremely flexible, commonly using document or key-value structures, making them ideal for unstructured data and massive scale.",
    "questionText": "What distinguishes SQL (Relational) databases from NoSQL (Non-relational) databases?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-18",
    "options": [
      "APIs will return an error if called twice",
      "Executing an operation multiple times yields the exact same state/result as executing it a single time (safe to retry)",
      "The API will always return a 200 OK status",
      "The API possesses lightning-fast execution speeds"
    ],
    "explanation": "Idempotency is crucial in distributed architecture (like payment APIs). It guarantees that if a request times out and the client issues a safe retry, the system will not inadvertently charge a user twice.",
    "questionText": "What does Idempotency mean in the context of API design?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-19",
    "options": [
      "By masking the user's IP Address",
      "By encrypting the network connection established between the Client and Server utilizing SSL/TLS protocols",
      "By blocking unauthorized third-party advertisements",
      "By natively accelerating network speeds securely"
    ],
    "explanation": "HTTPS relies upon Transport Layer Security (TLS/SSL) to robustly encrypt data payloads. This explicitly prevents eavesdroppers or intermediary agents from reading sensitive intercepted data.",
    "questionText": "How does HTTPS intrinsically protect transferred data?",
    "correctAnswerIndex": 1,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sd-20",
    "options": [
      "No, indexing is universally beneficial without downsides",
      "It significantly degrades reading (Select) operations",
      "It consumes additional storage space and notoriously slows down write operations (Write/Update/Insert)",
      "It inherently causes database crashes over time"
    ],
    "explanation": "While an Index drastically expedites read efficiency, the Database must actively spend processing power and storage continuously updating the Index tree for every single new Write/Update/Delete operation performed.",
    "questionText": "What are the common disadvantages associated with Database Indexing?",
    "correctAnswerIndex": 2,
    "category": "architecture",
    "topic": "system-design",
    "level": "junior",
    "codeSnippet": null
  }
]