[
  {
    "id": "sql-1",
    "options": [
      "It allows NULL values",
      "It must contain UNIQUE values and cannot be NULL, used to uniquely identify each row in a table",
      "You can define multiple Primary Keys on a single column",
      "It cannot be indexed"
    ],
    "explanation": "A Primary Key uniquely identifies a record (row) within a relational database table. A table can only have one primary key constraint, and none of its values can be NULL.",
    "questionText": "What are the characteristics of a PRIMARY KEY in SQL?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-2",
    "options": [
      "GET",
      "EXTRACT",
      "SELECT",
      "PULL"
    ],
    "explanation": "The SELECT statement is the fundamental command used to query and retrieve data from a relational database table.",
    "questionText": "Which SQL command is used to retrieve data from a database?",
    "correctAnswerIndex": 2,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-3",
    "options": [
      "All records from the left table",
      "All records from the right table",
      "Only the records with matching values in both tables",
      "All records from both tables combined"
    ],
    "explanation": "An INNER JOIN exclusively returns records that satisfy the specified join condition (matching records) in both combining tables.",
    "questionText": "What kind of result does an INNER JOIN return?",
    "correctAnswerIndex": 2,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-4",
    "options": [
      "To significantly increase read speeds",
      "To reduce data redundancy and maintain high Data Integrity",
      "To encrypt passwords and sensitive data",
      "To automatically create backups of tables"
    ],
    "explanation": "Database Normalization involves organizing data systematically to minimize redundancy and prevent logical errors ('update anomalies') when appending or deleting records.",
    "questionText": "What is the primary purpose of Database Normalization?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-5",
    "options": [
      "String manipulation functions",
      "Aggregate functions such as COUNT, SUM, AVG, MAX, MIN",
      "Date and time formatting functions",
      "Mathematical rounding functions"
    ],
    "explanation": "The GROUP BY statement groups rows that possess the same values into summary rows. It is prevalently used in conjunction with Aggregate functions to perform statistical computations per group.",
    "questionText": "In SQL, the GROUP BY clause is most commonly used accompanied by which type of functions?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-6",
    "options": [
      "To accelerate query speeds across complex tables",
      "To establish a link between two tables, ensuring Referential Integrity",
      "To safely encrypt and store user passwords",
      "To permit entirely duplicate rows across tables"
    ],
    "explanation": "A Foreign Key in a child table points to the Primary Key of a parent table. It strictly enforces referential integrity meaning you cannot record data in the child table if its reference does not exist in the parent.",
    "questionText": "What is the purpose of a FOREIGN KEY?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-7",
    "options": [
      "It doesn't slow down any operations",
      "INSERT, UPDATE, DELETE (Write operations)",
      "Multi-table JOINs",
      "Materialized VIEWs"
    ],
    "explanation": "Whenever data is manipulated via write operations (Insert/Update/Delete), the Database Engine must immediately update corresponding Indexes, causing write overhead.",
    "questionText": "Indexes significantly speed up SELECT queries, but they degrade the performance of which operations?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-8",
    "options": [
      "The numeric value 0",
      "An empty string",
      "An unknown or missing value",
      "Infinity or mathematical undefined"
    ],
    "explanation": "NULL is a distinct marker representing the absence of a value. It is fundamentally different from a zero integer or an empty string, therefore requiring special syntax (IS NULL) to evaluate.",
    "questionText": "What does a NULL value signify in SQL?",
    "correctAnswerIndex": 2,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-9",
    "options": [
      "They are functionally exactly identical",
      "DELETE is a DML command that removes row-by-row and can be rolled back; TRUNCATE is a DDL command that drops the table and re-creates it extremely fast without standard rollback capability",
      "DELETE executes much faster than TRUNCATE on large tables",
      "TRUNCATE freely supports complex WHERE clauses"
    ],
    "explanation": "TRUNCATE completely resets a table to its original state (including resetting identity counters) instantly. Due to being a Data Definition Language operation, it often prevents transactional backups in some database platforms.",
    "questionText": "What is the primary difference between the DELETE and TRUNCATE commands?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-10",
    "options": [
      "Redis",
      "PostgreSQL",
      "MongoDB",
      "Cassandra"
    ],
    "explanation": "MongoDB is a highly versatile Document-oriented NoSQL database. It natively stores schemas dynamically as BSON (Binary JSON), granting profound flexibility in design structures.",
    "questionText": "Which NoSQL Database persistently stores data as Documents (JSON/BSON formats)?",
    "correctAnswerIndex": 2,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-11",
    "options": [
      "WHERE identifies groups, HAVING filters distinct rows",
      "WHERE filters rows prior to the grouping execution; HAVING filters result groups after grouping logic successfully completes",
      "HAVING executes significantly faster than WHERE universally",
      "They are totally interchangeable aliases in modern dialects"
    ],
    "explanation": "The WHERE clause cannot be used with aggregate functions filtering groups, which is exactly the scenario where HAVING becomes mandated.",
    "questionText": "What is the technical difference between navigating the HAVING and WHERE clauses?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-12",
    "options": [
      "Immediately upon a successful transaction finalizing",
      "Whenever a fatal anomaly occurs or manually executed by a constraint condition, restoring database integrity safely to its pre-transaction state",
      "When the database reaches maximum partition capacity limits",
      "Automatically run triggered asynchronously every night"
    ],
    "explanation": "A Rollback acts as a safety mechanism securely reverting all transaction changes unconditionally to enforce true Atomicity (all or nothing execution).",
    "questionText": "Under what condition does a Transaction Rollback commonly execute?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-13",
    "options": [
      "A concrete table that statically mirrors identical data records on physical disks",
      "A Virtual Table conceptually derived straight out of the execution results yielded by a predefined SELECT query",
      "A User Interface construct specific to relational designs",
      "A localized archive system for disaster recovery backups"
    ],
    "explanation": "A standard View strictly does not possess physical persistence of data; it only persistently archives the SQL query logically executing it repeatedly behind the scenes upon being specifically addressed.",
    "questionText": "What defines a View within standard SQL definitions?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-14",
    "options": [
      "Shutting down external networking APIs unconditionally",
      "Actively applying Parameterized Queries (Prepared Statements) universally across application architecture limits",
      "Isolating database administrative permissions exclusively using IAMs",
      "Enforcing strictly hashed password configurations for normal users"
    ],
    "explanation": "Robustly designed Prepared Statements effectively decouple executable query syntax fundamentally from unpredictable external data inputs seamlessly nullifying unauthorized injections attempts naturally.",
    "questionText": "By implementing which of these critical safeguards can you prevent destructive SQL Injection vulnerabilities entirely?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-15",
    "options": [
      "Mitigating query payload loads directed upon application client hosting mechanisms",
      "Consolidating advanced business logic centrally on Server, unlocking pre-compiled optimized performance coupled with enhanced architectural secure executions",
      "Simplifying complex debugging techniques comparatively easier seamlessly compared against traditional Application codes",
      "Safeguarding extreme media blob artifacts globally accessible"
    ],
    "explanation": "A Stored Procedure compiles reliably minimizing extensive network latency naturally shifting heavy operational load logic inherently down deeply internally inside robust Server configurations strictly securely.",
    "questionText": "What concrete enterprise benefit actively materializes integrating native Stored Procedures predominantly?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-16",
    "options": [
      "Consistently archiving long-term massive structured relational data historically",
      "Enacting volatile Caching logic systems heavily, scaling ultra-fast Session persistence, and Message broker Pub/Sub event broadcasting",
      "Performing exceptionally advanced Analytical big data data-warehouse executions reliably over decades naturally",
      "Archiving massive static user media image blobs locally efficiently"
    ],
    "explanation": "Redis functions precisely dominating deeply effectively as purely rapid In-memory generic Key-Value execution systems structurally optimizing Application Caching throughputs remarkably.",
    "questionText": "For what fundamental architectural purpose is Redis normally integrated predominantly?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-17",
    "options": [
      "A Clustered physically sorts data intrinsically based on the defined key permanently natively; A Non-Clustered virtually stores abstract referenced external lists pointing structurally back",
      "A profoundly generic Non-Clustered always universally resolves identically faster executing",
      "Any singular abstract table allows universally configuring fundamentally boundless unlimited Clustered allocations structurally freely",
      "A native Clustered Index continually bloats structural capacities aggressively extensively unmaintainable"
    ],
    "explanation": "It's profoundly strict systematically that precisely merely exactly one singular individual Clustered Index universally uniquely exists naturally enforcing actual explicit physical hierarchical storage structure persistently inherently.",
    "questionText": "How fundamentally uniquely differs a Clustered Index contrasted against generic Non-Clustered Index iterations systematically?",
    "correctAnswerIndex": 0,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-18",
    "options": [
      "Inherently enforcing internal data integrity persistently constantly continuously logically unconditionally universally natively correctly",
      "Explicitly validating a strictly confirmed transaction inherently persistently solidifying its survival aggressively reliably outlasting sudden catastrophic external interruptions intrinsically definitively",
      "A system completely neutralizing any mechanical server degradation faults inevitably reliably permanently natively smoothly",
      "Transactions logically scaling rapidly fast organically natively remarkably"
    ],
    "explanation": "Durability defines strictly how finalized confirmed modifications fundamentally genuinely successfully secure unchangeably reliably forever systematically integrating robust resilient physical backup redundancy immediately fundamentally effectively.",
    "questionText": "What strict distinct assurance crucially defines the 'Durability' property inside traditional ACID requirements functionally?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-19",
    "options": [
      "Structurally directly relating abstract distinct relational arrays connecting exclusively uniquely horizontally natively",
      "Merging uniquely independent result arrays linearly expanding vertically identically resolving systematically eradicating redundant identical entries fully predictably transparently reliably",
      "Expanding multiple arrays merging continuously structurally duplicating exclusively aggressively linearly transparently exactly identically forever",
      "Unconditionally wiping historical architectural schemas fundamentally effectively totally identically completely universally"
    ],
    "explanation": "Executing UNION consolidates natively separated distinct individual distinct query matrix arrays stacking progressively uniformly filtering exactly eradicating duplications whereas simply utilizing UNION ALL intentionally bypasses identical removal logic radically accelerating raw execution speed natively fully.",
    "questionText": "What exact operational manipulation universally uniquely defines naturally the distinct 'UNION' execution exactly predictably?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-20",
    "options": [
      "Methodically meticulously individually accurately stringently scanning precisely completely independently individually natively exclusively character predictably identical characters individually sequentially linearly transparently exactly universally",
      "An advanced linguistic text search functionality designed distinctly inherently to parse colossal textual data universally supporting synonymous semantic matching, linguistic stemming intelligently natively ranking dynamically seamlessly",
      "Searching directories effectively natively transparently systematically fully exactly predictably universally fundamentally completely successfully securely completely quickly identically dependably automatically",
      "An image processing tool identifying facial recognition reliably intelligently precisely natively cleanly natively effectively identically dependably transparently natively fully transparently securely identically uniquely completely accurately completely smoothly dependably uniquely"
    ],
    "explanation": "Instead of executing dreadfully incredibly lagging LIKE wildcard clauses structurally a Full Text Search profoundly uniquely intelligently interprets distinct linguistics remarkably returning search intent natively structurally reliably accurately comprehensively naturally.",
    "questionText": "What significantly distinct functionality defines exactly natively the fundamental structural essence representing inherently 'Full Text Search' intrinsically?",
    "correctAnswerIndex": 1,
    "category": "backend",
    "topic": "sql",
    "level": "junior",
    "codeSnippet": null
  },
  {
    "id": "sql-adv-1",
    "category": "backend",
    "topic": "sql-databases",
    "level": "medium",
    "questionText": "What is a key benefit of using Common Table Expressions (CTEs) over traditional Subqueries?",
    "codeSnippet": "WITH HighValueCustomers AS (\n    SELECT customer_id, SUM(amount) as total\n    FROM orders\n    GROUP BY customer_id\n    HAVING SUM(amount) > 1000\n)\nSELECT users.name, hvc.total\nFROM users\nJOIN HighValueCustomers hvc ON users.id = hvc.customer_id;",
    "options": [
      "CTEs automatically create permanent tables in the database",
      "CTEs execute much faster than subqueries because they are pre-compiled",
      "CTEs are more readable, easier to maintain, and can be referenced multiple times or used for recursive queries",
      "CTEs can be used directly as a replacement for the WHERE clause"
    ],
    "correctAnswerIndex": 2,
    "explanation": "CTEs (using the WITH clause) improve query readability by breaking complex queries into simpler blocks. They can also be referenced multiple times in the main query and support recursive operations, unlike standard subqueries."
  },
  {
    "id": "sql-adv-2",
    "category": "backend",
    "topic": "sql-databases",
    "level": "senior",
    "questionText": "When creating a composite index on multiple columns, which order is generally recommended?",
    "codeSnippet": "SELECT * FROM users WHERE status = 'active' AND last_login < '2023-01-01';",
    "options": [
      "Columns with string values first, integers second",
      "Equality conditions first, range conditions last",
      "Range conditions first, equality conditions last",
      "Alphabetical order based on the column names"
    ],
    "correctAnswerIndex": 1,
    "explanation": "The golden rule for composite indexes is 'Equality First, Range Last'. If you index (status, last_login), the database can filter all 'active' users and then sequentially scan the dates. If you indexed the range first, it couldn't optimize the equality filter efficiently."
  },
  {
    "id": "sql-adv-3",
    "category": "backend",
    "topic": "sql-databases",
    "level": "medium",
    "questionText": "What does a LEFT JOIN do?",
    "codeSnippet": null,
    "options": [
      "Returns only the records that have matching values in both tables",
      "Returns all records from the left table, and the matched records from the right table. If there is no match, the result is NULL on the right side.",
      "Returns all records from the right table, and the matched records from the left table.",
      "Returns all records when there is a match in either left or right table"
    ],
    "correctAnswerIndex": 1,
    "explanation": "A LEFT JOIN guarantees that every row from the 'left' table (the first table mentioned) is included in the result set. If there's a corresponding row in the 'right' table, its data is attached; otherwise, NULL fields are appended."
  },
  {
    "id": "sql-adv-4",
    "category": "backend",
    "topic": "sql-databases",
    "level": "senior",
    "questionText": "Which type of SQL function should you use to perform a calculation across a set of table rows that are related to the current row, without collapsing them into a single aggregate row?",
    "codeSnippet": "RANK() OVER (PARTITION BY department ORDER BY salary DESC)",
    "options": [
      "Aggregate Functions (like SUM or AVG)",
      "Scalar Functions",
      "Window Functions",
      "Stored Procedures"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Window functions (like RANK(), ROW_NUMBER(), LEAD(), LAG()) perform calculations across a defined 'window' of rows related to the current one, but unlike aggregate functions, they do not group or collapse the rows—each row retains its original identity."
  },
  {
    "id": "sql-adv-5",
    "category": "backend",
    "topic": "sql-databases",
    "level": "junior",
    "questionText": "In the context of database transactions, what does 'Atomicity' in ACID properties guarantee?",
    "codeSnippet": null,
    "options": [
      "Transactions are processed at atomic speeds (nanoseconds)",
      "All parts of a transaction succeed completely, or the entire transaction fails and rolls back (all or nothing)",
      "Data from one transaction is completely isolated from others until committed",
      "The database schema is atomic and cannot be altered during a transaction"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Atomicity means 'all or nothing'. If a transaction consists of several operations (e.g., deducting money from Account A and adding it to Account B), either all operations succeed and commit, or if one fails, the database rolls back to its state before the transaction began."
  },
  {
    "id": "sql-adv-6",
    "category": "backend",
    "topic": "sql-databases",
    "level": "medium",
    "questionText": "In which of the following scenarios is it NOT recommended to create an index?",
    "codeSnippet": null,
    "options": [
      "On a Primary Key column",
      "On a Foreign Key column used for JOINs",
      "On a column with very low cardinality, like 'Gender' (M/F) or 'Status' (Active/Inactive), in a large table",
      "On a column frequently used in an ORDER BY clause"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Standard B-Tree indexes are inefficient for low-cardinality columns (columns with very few unique values). The database optimizer will often ignore the index and opt for a full table scan anyway because pulling data from the index and then looking up the actual rows is slower than just scanning the whole table."
  }
]